# Formas de Seleção

## Criando DataFrame

In [1]:
import pandas as pd

In [3]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split()) #Argumentos do DataFrame (dados, rótulos linhas, rótulos colunas)
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [4]:
#Obs função split: faz uma lista com cada elemento, separado pelo argumento da função, sendo default um espaçamento:

In [6]:
lista1 = '11 12 13 14'.split() 
lista1

['11', '12', '13', '14']

In [8]:
lista2 = '21,22,23,24'.split(',')
lista2

['21', '22', '23', '24']

## Seleção Colunas

In [10]:
#Seleciona coluna pelo rótulo
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [11]:
#Isso gera uma series
type(df['c1'])

pandas.core.series.Series

In [13]:
#Seleção de mais de uma coluna, em qualquer sequência
df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

## Seleção Linhas

In [14]:
#Intervalo de linhas usando índice
df[1:3] #Obs: a contagem de linhas começa no zero, o primeiro termo é incluído e o último é excluído

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [18]:
#Para selecionar uma ou mais linhas a partir do índice
df.loc[['l3','l1']]

    c1  c2  c3  c4
l3   8  10  11  12
l1   1   2   3   4

## Seleção Colunas e Linhas

In [15]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [19]:
#Podemos ainda selecionar a intersecção entre linhas e colunas usado a função loc
df.loc['l1', 'c2']

2

In [20]:
df.loc['l1', ['c1','c2']]

c1    1
c2    2
Name: l1, dtype: int64

In [21]:
#O método .iloc[] permite selecionar pelo índice, coloca-se no primeiro argumento a linha, no segundo a coluna
df.iloc[1,3]

8

In [22]:
df.iloc[[0,1],3]

l1    4
l2    8
Name: c4, dtype: int64